https://www.youtube.com/watch?v=OYZNk7Z9s6I

https://www.youtube.com/watch?v=15q-is8P_H4

#  Purpose of Index:

     1. Identification
     
     2. Selection
     
     3. Alignment

### What do I need to know about the Pandas Index?

In [36]:
import pandas as pd

In [37]:
drinks = pd.read_csv("http://bit.ly/drinksbycountry")

In [38]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [39]:
drinks.shape

(193, 6)

### Rows (or) Index

In [17]:
drinks.index

RangeIndex(start=0, stop=193, step=1)

In [18]:
drinks.index.values

array([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
        13,  14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,
        26,  27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,
        39,  40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,
        52,  53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,
        65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,
        78,  79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,
        91,  92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103,
       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116,
       117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129,
       130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142,
       143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
       156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168,
       169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181,
       182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192], dtype=int64)

### Column (or) Header

In [19]:
drinks.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [20]:
drinks.columns.values

array(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'], dtype=object)

### Reading Table
#### read_table  ----->   read_csv        (deprecated)

In [21]:
pd.read_table('http://bit.ly/movieusers', header=None, sep='|').head()

C:\Users\deepusuresh\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067
3  4  24  M  technician  43537
4  5  33  F       other  15213

In [22]:
drinks[drinks.continent=='South America']

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
6,Argentina,193,25,221,8.3,South America
20,Bolivia,167,41,8,3.8,South America
23,Brazil,245,145,16,7.2,South America
35,Chile,130,124,172,7.6,South America
37,Colombia,159,76,3,4.2,South America
52,Ecuador,162,74,3,4.2,South America
72,Guyana,93,302,1,7.1,South America
132,Paraguay,213,117,74,7.3,South America
133,Peru,163,160,21,6.1,South America
163,Suriname,128,178,7,5.6,South America
185,Uruguay,115,35,220,6.6,South America
188,Venezuela,333,100,3,7.7,South America

In [23]:
drinks.loc[23,'beer_servings']

245

In [24]:
drinks.set_index('country', inplace=True)
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [25]:
drinks.index

Index(['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
       'Antigua & Barbuda', 'Argentina', 'Armenia', 'Australia', 'Austria',
       ...
       'Tanzania', 'USA', 'Uruguay', 'Uzbekistan', 'Vanuatu', 'Venezuela',
       'Vietnam', 'Yemen', 'Zambia', 'Zimbabwe'],
      dtype='object', name='country', length=193)

In [26]:
drinks.columns          # 'country' not comes in column list

Index(['beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [27]:
drinks.shape

(193, 5)

In [29]:
drinks.loc['Brazil','beer_servings']

245

In [30]:
drinks.index.name=None
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [31]:
drinks.index.name = 'country'
drinks.reset_index(inplace=True)
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [32]:
drinks.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

In [33]:
drinks.describe().index

Index(['count', 'mean', 'std', 'min', '25%', '50%', '75%', 'max'], dtype='object')

In [34]:
drinks.describe().columns

Index(['beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol'],
      dtype='object')

In [35]:
drinks.describe().loc['25%','beer_servings']

20.0

-------------------------------------------------------------------------------------------------------------------------------

In [40]:
drinks.continent.head()

0      Asia
1    Europe
2    Africa
3    Europe
4    Africa
Name: continent, dtype: object

In [41]:
drinks.set_index('country', inplace=True)
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [42]:
drinks.continent.head()

country
Afghanistan      Asia
Albania        Europe
Algeria        Africa
Andorra        Europe
Angola         Africa
Name: continent, dtype: object

In [43]:
drinks.continent.value_counts()

Africa           53
Europe           45
Asia             44
North America    23
Oceania          16
South America    12
Name: continent, dtype: int64

In [44]:
drinks.continent.value_counts().index

Index(['Africa', 'Europe', 'Asia', 'North America', 'Oceania',
       'South America'],
      dtype='object')

In [45]:
drinks.continent.value_counts().values

array([53, 45, 44, 23, 16, 12], dtype=int64)

In [47]:
drinks.continent.value_counts()['Africa']

53

In [48]:
drinks.continent.value_counts().sort_values()

South America    12
Oceania          16
North America    23
Asia             44
Europe           45
Africa           53
Name: continent, dtype: int64

In [49]:
drinks.continent.value_counts().sort_index()

Africa           53
Asia             44
Europe           45
North America    23
Oceania          16
South America    12
Name: continent, dtype: int64

In [50]:
people = pd.Series([3000000, 85000], index=['Albania','Andorra'], name='population')
people

Albania    3000000
Andorra      85000
Name: population, dtype: int64

In [54]:
drinks.beer_servings * people

Afghanistan                      NaN
Albania                 9.000000e+12
Algeria                          NaN
Andorra                 7.225000e+09
Angola                           NaN
Antigua & Barbuda                NaN
Argentina                        NaN
Armenia                          NaN
Australia                        NaN
Austria                          NaN
Azerbaijan                       NaN
Bahamas                          NaN
Bahrain                          NaN
Bangladesh                       NaN
Barbados                         NaN
Belarus                          NaN
Belgium                          NaN
Belize                           NaN
Benin                            NaN
Bhutan                           NaN
Bolivia                          NaN
Bosnia-Herzegovina               NaN
Botswana                         NaN
Brazil                           NaN
Brunei                           NaN
Bulgaria                         NaN
Burkina Faso                     NaN
Burundi                          NaN
Cabo Verde                       NaN
Cambodia                         NaN
                            ...
Sudan                            NaN
Suriname                         NaN
Swaziland                        NaN
Sweden                           NaN
Switzerland                      NaN
Syria                            NaN
Tajikistan                       NaN
Tanzania                         NaN
Thailand                         NaN
Timor-Leste                      NaN
Togo                             NaN
Tonga                            NaN
Trinidad & Tobago                NaN
Tunisia                          NaN
Turkey                           NaN
Turkmenistan                     NaN
Tuvalu                           NaN
USA                              NaN
Uganda                           NaN
Ukraine                          NaN
United Arab Emirates             NaN
United Kingdom                   NaN
Uruguay                          NaN
Uzbekistan                       NaN
Vanuatu                          NaN
Venezuela                        NaN
Vietnam                          NaN
Yemen                            NaN
Zambia                           NaN
Zimbabwe                         NaN
Length: 193, dtype: float64

In [55]:
pd.concat([drinks, people], axis=1).head()

C:\Users\deepusuresh\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,population
Afghanistan,NaN,0,0,0.0,Asia,NaN
Albania,3000000.0,132,54,4.9,Europe,3000000.0
Algeria,NaN,0,14,0.7,Africa,NaN
Andorra,85000.0,138,312,12.4,Europe,85000.0
Angola,NaN,57,45,5.9,Africa,NaN